'''
有一个列表，[“北京”,”上海”,”广东”]
1)	将中国所有省会城市添加到上述列表中
2)	广东成为第二大发达城市，将广东排在上海前面
1.删除广东   li.remove(“广东”)
2.添加  li.insert(1,”广东”)
3)	[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。

'''
pro= ["北京","上海","广东"]
pro.extend(["杭州","成都","武汉","天津","重庆","沈阳","南京","长沙","郑州","济南","哈尔滨","石家庄","长春","西安","福州"])
print(pro)

pro.remove("广东")
pro.insert(1,"广东")

GDP=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
ZH= sum (GDP)

print("前8城市的GDP总和:",ZH)
print("前8城市的平均GDP",ZH/len(GDP))
